Revit 2024 API
IdlingEventArgs.SetRaiseWithoutDelay Method
 Sets the next invocation of the idling event to be called promptly, rather than relying on the default recurrence of idling from the Revit application. For more details see the remarks describing the Idling event.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void SetRaiseWithoutDelay()
Visual Basic
Public Sub SetRaiseWithoutDelay
Visual C++
public:
void SetRaiseWithoutDelay()
See Also
IdlingEventArgs Class
Autodesk.Revit.UI.Events Namespace